tap "homebrew/bundle"
tap "homebrew/core"

brew "aspell"
brew "fzf"
brew "git"
brew "highlight"
brew "jq"

# Doesn't work properly.
# brew "neovim"

brew "pyenv"
brew "stow"
brew "tmux"
brew "xmlstarlet"

brew "coreutils" if OS.mac?
brew "findutils" if OS.mac?

tap "homebrew/cask"

# Quicklook plugins for various files
cask "qlcolorcode"
cask "quicklook-csv"
cask "quicklook-json"
cask "qlmarkdown"

# Quicklook plaintext if no extension
cask "qlstephen"

tap "homebrew/cask-fonts"
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-fira-mono'
cask 'font-source-code-pro'
cask 'font-iosevka'
cask 'font-fontawesome'
cask 'font-input'
