# Run `brew bundle` in this folder to install
# Run with Terminal the first thing you do

# Core dependencies
brew 'automake'
brew 'autoconf'
brew 'cmake'
brew 'readline'     # Replace libedit which is buggy
brew 'gdbm'         # Hash database
brew 'gmp'          # Arbitrary precision arithmetics
brew 'gettext'      # i18n
brew 'libevent'
brew 'libtool'
brew 'libffi'       # FFI support
brew 'openssl'
brew 'pkg-config'
brew 'pth'          # GNU Portable Threads
brew 'makedepend'
brew 'xz'           # Compression
brew 'libyaml'      # Fast read-write YAML

# E-mail
# brew 'isync'

# Core utilities
brew 'coreutils'
brew 'findutils'
brew 'stow'           # Manage dotfiles
brew 'fzf'            # Command line fuzzy finder
brew 'the_silver_searcher' # Code search
brew 'git'
brew 'gnupg2'         # Encryption
brew 'gpgme'          # Makes GnuPG easier to use
brew 'pinentry-mac'
brew 'sqlite'
brew 'tmux'
brew 'tree'
tap 'neovim/neovim'
brew 'neovim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# Core languages/VMs
brew 'tcl-tk'
brew 'python'
brew 'python3'
brew 'ruby'
brew 'go'

# install using nvm instead
# brew 'node', args: ['with-openssl']
brew 'nvm'

# Misc utilities
brew 'ansible'            # Deployment automation
brew 'aspell'             # GNU spell check
brew 'ydiff'              # Colorized diffing (replaces colordiff)
brew 'grc'                # Generic Colorizer
brew 'trash'              # CLI for macOS trash
brew 'highlight'          # Highlight source code
brew 'jq'                 # JSON grep utility

# Databases
brew 'postgresql'

# Cask
tap 'caskroom/cask'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'visual-studio-code'
cask 'postman'
cask 'iterm2'
cask 'keybase'
cask 'transmission'
cask 'vlc'
cask 'slack'
cask 'spotify'

tap 'homebrew/cask-versions'
cask 'firefox-nightly'

cask '1password'
cask 'karabiner-elements'
cask 'hammerspoon'

# Quicklook plugins
cask 'qlmarkdown'     # Markdown preview with Quicklook
cask 'qlcolorcode'    # Syntax highlighting for Quicklook
cask 'quicklook-json' # JSON for Quicklook
cask 'quicklook-csv'  # CSV display for Quicklook
cask 'qlstephen'      # Quicklook plaintext without extensions

# Fonts
tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-fira-mono'
cask 'font-source-code-pro'
cask 'font-iosevka'

# Tiling WM
tap 'crisidev/homebrew-chunkwm'
brew 'koekeishiya/formulae/skhd'
brew 'chunkwm'
